Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_HAL_ROM.h
#ifndef __RTL8721D_HAL_H__
#define __RTL8721D_HAL_H__

#include "RTL8721D_Reg_ROM.h"
#include "RTL8721D_debug_ROM.h"
#include "RTL8721D_Init_ROM.h"
#include "RTL8721D_INT_ROM.h"
#include "RTL8721D_Util_ROM.h"
//#include "RTL8721D_Coex.h"
#include "RTL8721D_cmd_ROM.h"
#include "RTL8721D_PhyReg_ROM.h"
#include "RTL8721D_PhyCfg_ROM.h"
//#include "RTL8721D_Efuse.h"
#include "RTL8721D_Packet_ROM.h"
#include "RTL8721D_PowerCtrl_ROM.h"
//#include "RTL8721D_Initial_Offload.h"
#include "RTL8721D_IOPath_ROM.h"
#include "RTL8721D_FWLBK_ROM.h"
#include "RTL8721D_TxReport_ROM.h"
//#include "RTL8721D_DLFW.h"
#include "RTL8721D_RateAdaptive_ROM.h"
#include "RTL8721D_BTConCurr_ROM.h"
//#include "RTL8721D_FastChannelSwitch.h"
#include "RTL8721D_DMA_ROM.h"

//1 Code Memory Map
//
// 0x0000 ~ 0x3FFF: IROM
// 0x4000 ~ 0xBFFF: code dwonload ram 32K
// 0xC000 ~ 0xFFFF: TX pkt buff high 16K


//1 Xdata Memory Map
//
// 0x0000 ~ 0x7FFF: MAC Register
// 0x0800 ~ 0x0FFF: BB Register
// 0x1000 ~ 0x1FFF: download ram space
// 0x2000 ~ 0x2FFF: RSVD
// 0x3000 ~ 0x3FFF: ext ptcl reg
// 0x4000 ~ 0x7FFF: RSVD
// 0x8000 ~ 0x9FFF: XData & TXRPT
// 0xEE00 ~ 0xEE47: USB descriptor RAM
// 0xEE48 ~ 0xFAFF: RSVD
// 0xF000 ~ 0xF0FF: usb3 register
// 0xFB00 ~ 0xFBFF: RxPktBuf
// 0xFC00 ~ 0xFCFF: TxPktBuf
// 0xFD00 ~ 0xFDFF: 8051 Internal
// 0xFE00 ~ 0xFEFF: USB Register
// 0xFF00 ~ 0xFFFF: RSVD


/*--------------------------Define -------------------------------------------*/
//3 TaskBitMap0
#define RATEADAPTIVE        BIT0
#define H2CEVENT            BIT1
#define C2HEVENT            BIT2
#define RLPSEVENT           BIT3
#define REMOTEWAKEEVENT     BIT4
#define APOFFLOADEVENT      BIT5
#define MAILBOXEVENT        BIT6
#define SWTIMEREVENT        BIT7

//3 TaskBitMap1
#define BBNHMEVENT          BIT0
#define DBGPKTEVENT         BIT1
#define SIDEBANDWoWLAN      BIT2


//3 MAC base address
#define RTL8721D_IOREG_AHB_BASE             0x40080000
//3 BB base address
#define RTL8721D_BBREG_AHB_BASE             0x40082800 //0x40083000-0x800
//3 RF base address
#define RTL8721D_RFREG_AHB_BASE             0x40083800 
//3 DDMA control base address
#define RTL8721D_DDMA_CTRL_AHB_BASE         0x40081100 //1100~115B  11E0~11FF
//3 BT mailbox base address
#define RTL8721D_BT_MAILBOX_AHB_BASE        0x40081160 //1160~1177

//#define RTL8721D_UART0_CTRL_AHB_BASE         0x18002000
//#define RTL8721D_CPU_CTRL_AHB_BASE             RTL8814A_IOREG_OCP_BASE
//#define RTL8721D_CPU_LOCAL_AHB_BASE           0x18003400
//#define RTL8721D_FLASH_CTRL_AHB_BASE          0X18009000

//#define RTL8721D_LLT_AHB_BASE                      0x18650000
//3 TxReport Buffer base address
#define RTL8721D_RPTBUF_AHB_BASE            0x400B0000
#define RTL8721D_SPERPT_BASE                (RTL8721D_RPTBUF_AHB_BASE)
#define RTL8721D_BCNRPT_BASE                (RTL8721D_RPTBUF_AHB_BASE+0x80)
#define RTL8721D_TXRPT_BASE                 (RTL8721D_RPTBUF_AHB_BASE+0x100)
#define RTL8721D_RAMASK_BASE                (RTL8721D_RPTBUF_AHB_BASE+0x200)
#define RTL8721D_NANRPT_BASE                (RTL8721D_RPTBUF_AHB_BASE+0x280)

//3 Rx packet buffer base address
#define RTL8721D_RXFF_AHB_BASE              0x400A0000

//3 Tx packet buffer base address
#define RTL8721D_TXFF_AHB_BASE              0x40090000

//3 CAM base address
#define RTL8721D_SECCAM_AHB_BASE            0x40081A00
#define RTL8721D_WOWCAM_AHB_BASE            0x18674000
//#define RTL8721D_RXFILTERCAM_AHB_BASE       0x18676000
#define RTL8721D_BACAM_AHB_BASE             0x40081800
//#define RTL8721D_ADDRCAM_AHB_BASE           0x18678000

//3 HPON base address
#define RTL8721D_HPON_AHB_BASE              0x40080000

/*CPU Sram*/
//#define RTL8721D_FLASH_MEM_AHB_BASE         0x10000000
//#define RTL8721D_IMEM_AHB_BASE              0x00000000
//#define RTL8721D_DMEM_AHB_BASE              0x00200000
//#define RTL8721D_ERAM_AHB_BASE              0x00100000

//offset:
#define rtl_inb(offset)             (*(volatile u8 *)((u32)offset))
#define rtl_inw(offset)             (*(volatile u16 *)((u32)offset))
#define rtl_inl(offset)             (*(volatile u32 *)((u32)offset))

#define rtl_outb(offset,val)        do { (*(volatile u8 *)((u32)offset) = (val));    } while(0)
#define rtl_outw(offset,val)        do { (*(volatile u16 *)((u32)offset) = (val));    } while(0)
#define rtl_outl(offset,val)        do { (*(volatile u32 *)((u32)offset) = (val));    } while(0)


//3 MACREG

//offset :
#define WritePONRegDWord(offset, value)     rtl_outl((offset+RTL8721D_HPON_AHB_BASE), value)
#define WritePONRegWord(offset, value)      rtl_outw((offset+RTL8721D_HPON_AHB_BASE), value)
#define WritePONRegByte(offset, value)      rtl_outb((offset+RTL8721D_HPON_AHB_BASE), value)

#define ReadPONRegDWord(offset)             (rtl_inl((offset+RTL8721D_HPON_AHB_BASE)))
#define ReadPONRegWord(offset)              (rtl_inw((offset+RTL8721D_HPON_AHB_BASE)))
#define ReadPONRegByte(offset)              (rtl_inb((offset+RTL8721D_HPON_AHB_BASE)))


//offset :
#define WriteMACRegDWord(offset, value)     rtl_outl((offset+RTL8721D_IOREG_AHB_BASE), value)
#define WriteMACRegWord(offset, value)      rtl_outw((offset+RTL8721D_IOREG_AHB_BASE), value)
#define WriteMACRegByte(offset, value)      rtl_outb((offset+RTL8721D_IOREG_AHB_BASE), value)

#define ReadMACRegDWord(offset)             (rtl_inl((offset+RTL8721D_IOREG_AHB_BASE)))
#define ReadMACRegWord(offset)              (rtl_inw((offset+RTL8721D_IOREG_AHB_BASE)))
#define ReadMACRegByte(offset)              (rtl_inb((offset+RTL8721D_IOREG_AHB_BASE)))

//3 BB Reg
#define WritePortBBUlong(offset, value)     rtl_outl((offset+RTL8721D_BBREG_AHB_BASE), value)
#define WritePortBBUshort(offset, value)    rtl_outw((offset+RTL8721D_BBREG_AHB_BASE), value)
#define WritePortBBUchar(offset, value)     rtl_outb((offset+RTL8721D_BBREG_AHB_BASE), value)

#define ReadPortBBUlong(offset)             (rtl_inl((offset+RTL8721D_BBREG_AHB_BASE)))
#define ReadPortBBUshort(offset)            (rtl_inw((offset+RTL8721D_BBREG_AHB_BASE)))
#define ReadPortBBUchar(offset)             (rtl_inb((offset+RTL8721D_BBREG_AHB_BASE)))

