Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_HAL_ROM.h
//3 RF Reg only support dword mode
#define WritePortRFUlong(offset, value)     rtl_outl((4*offset+RTL8721D_RFREG_AHB_BASE), value)
#define ReadPortRFUlong(offset)             (rtl_inl((4*offset+RTL8721D_RFREG_AHB_BASE)))

//3 SEC CAM
#define WriteSECCAMDWord(offset, value)  rtl_outl((offset+RTL8721D_SECCAM_AHB_BASE), value)
#define WriteSECCAMWord(offset, value)   rtl_outw((offset+RTL8721D_SECCAM_AHB_BASE), value)
#define WriteSECCAMByte(offset, value)   rtl_outb((offset+RTL8721D_SECCAM_AHB_BASE), value)

#define ReadSECCAMDWord(offset)          (rtl_inl((offset+RTL8721D_SECCAM_AHB_BASE)))
#define ReadSECCAMWord(offset)           (rtl_inw((offset+RTL8721D_SECCAM_AHB_BASE)))
#define ReadSECCAMByte(offset)           (rtl_inb((offset+RTL8721D_SECCAM_AHB_BASE)))

//3 WOW CAM
#define WriteWOWCAMDWord(offset, value)  rtl_outl((offset+RTL8721D_WOWCAM_AHB_BASE), value)
#define WriteWOWCAMWord(offset, value)   rtl_outw((offset+RTL8721D_WOWCAM_AHB_BASE), value)
#define WriteWOWCAMByte(offset, value)   rtl_outb((offset+RTL8721D_WOWCAM_AHB_BASE), value)

#define ReadWOWCAMDWord(offset)          (rtl_inl((offset+RTL8721D_WOWCAM_AHB_BASE)))
#define ReadWOWCAMWord(offset)           (rtl_inw((offset+RTL8721D_WOWCAM_AHB_BASE)))
#define ReadWOWCAMByte(offset)           (rtl_inb((offset+RTL8721D_WOWCAM_AHB_BASE)))

#if 0
//3 RX FILTER CAM
#define WriteRXFILTERCAMDWord(offset, value)  rtl_outl((offset+RTL8814B_RXFILTERCAM_VIRTUAL_BASE), value)
#define WriteRXFILTERCAMWord(offset, value)   rtl_outw((offset+RTL8814B_RXFILTERCAM_VIRTUAL_BASE), value)
#define WriteRXFILTERCAMByte(offset, value)   rtl_outb((offset+RTL8814B_RXFILTERCAM_VIRTUAL_BASE), value)

#define ReadRXFILTERCAMDWord(offset)          (rtl_inl((offset+RTL8814B_RXFILTERCAM_VIRTUAL_BASE)))
#define ReadRXFILTERCAMWord(offset)           (rtl_inw((offset+RTL8814B_RXFILTERCAM_VIRTUAL_BASE)))
#define ReadRXFILTERCAMByte(offset)           (rtl_inb((offset+RTL8814B_RXFILTERCAM_VIRTUAL_BASE)))
#endif

//3 BA CAM
#define WriteBACAMDWord(offset, value)  rtl_outl((offset+RTL8721D_BACAM_AHB_BASE), value)
#define WriteBACAMWord(offset, value)   rtl_outw((offset+RTL8721D_BACAM_AHB_BASE), value)
#define WriteBACAMByte(offset, value)   rtl_outb((offset+RTL8721D_BACAM_AHB_BASE), value)

#define ReadBACAMDWord(offset)          (rtl_inl((offset+RTL8721D_BACAM_AHB_BASE)))
#define ReadBACAMWord(offset)           (rtl_inw((offset+RTL8721D_BACAM_AHB_BASE)))
#define ReadBACAMByte(offset)           (rtl_inb((offset+RTL8721D_BACAM_AHB_BASE)))

#if 0
//3 ADDR CAM
#define WriteADDRCAMDWord(offset, value)  rtl_outl((offset+RTL8814B_ADDRCAM_VIRTUAL_BASE), value)
#define WriteADDRCAMWord(offset, value)   rtl_outw((offset+RTL8814B_ADDRCAM_VIRTUAL_BASE), value)
#define WriteADDRCAMByte(offset, value)   rtl_outb((offset+RTL8814B_ADDRCAM_VIRTUAL_BASE), value)

#define ReadADDRCAMDWord(offset)          (rtl_inl((offset+RTL8814B_ADDRCAM_VIRTUAL_BASE)))
#define ReadADDRCAMWord(offset)           (rtl_inw((offset+RTL8814B_ADDRCAM_VIRTUAL_BASE)))
#define ReadADDRCAMByte(offset)           (rtl_inb((offset+RTL8814B_ADDRCAM_VIRTUAL_BASE)))
#endif

//3 ReportBUFF
#define WriteRPTBUFDWord(offset, value)  rtl_outl((offset+RTL8721D_RPTBUF_AHB_BASE), value)
#define WriteRPTBUFWord(offset, value)   rtl_outw((offset+RTL8721D_RPTBUF_AHB_BASE), value)
#define WriteRPTBUFByte(offset, value)   rtl_outb((offset+RTL8721D_RPTBUF_AHB_BASE), value)

#define ReadRPTBUFDWord(offset)          (rtl_inl((offset+RTL8721D_RPTBUF_AHB_BASE)))
#define ReadRPTBUFWord(offset)           (rtl_inw((offset+RTL8721D_RPTBUF_AHB_BASE)))
#define ReadRPTBUFByte(offset)           (rtl_inb((offset+RTL8721D_RPTBUF_AHB_BASE)))

#if 0
//3 RXFF_FW
#define WriteRXFF2DWord(offset, value)  rtl_outl((offset+RTL8814A_FWFF_VIRTUAL_BASE), value)
#define WriteRXFF2Word(offset, value)   rtl_outw((offset+RTL8814A_FWFF_VIRTUAL_BASE), value)
#define WriteRXFF2Byte(offset, value)   rtl_outb((offset+RTL8814A_FWFF_VIRTUAL_BASE), value)

#define ReadRXFF2DWord(offset)          (rtl_inl((offset+RTL8814A_FWFF_VIRTUAL_BASE)))
#define ReadRXFF2Word(offset)           (rtl_inw((offset+RTL8814A_FWFF_VIRTUAL_BASE)))
#define ReadRXFF2Byte(offset)           (rtl_inb((offset+RTL8814A_FWFF_VIRTUAL_BASE)))
#endif

//3 RXFF
#define WriteRXFFDWord(offset, value)   rtl_outl((offset+RTL8721D_RXFF_AHB_BASE), value)
#define WriteRXFFWord(offset, value)    rtl_outw((offset+RTL8721D_RXFF_AHB_BASE), value)
#define WriteRXFFByte(offset, value)    rtl_outb((offset+RTL8721D_RXFF_AHB_BASE), value)

#define ReadRXFFDWord(offset)           (rtl_inl((offset+RTL8721D_RXFF_AHB_BASE)))
#define ReadRXFFWord(offset)            (rtl_inw((offset+RTL8721D_RXFF_AHB_BASE)))
#define ReadRXFFByte(offset)            (rtl_inb((offset+RTL8721D_RXFF_AHB_BASE)))

#if 0
//3 RXDFF
#define WriteRXDFFDWord(offset, value)   rtl_outl((offset+RTL8814B_RXDFF_VIRTUAL_BASE), value)
#define WriteRXDFFWord(offset, value)    rtl_outw((offset+RTL8814B_RXDFF_VIRTUAL_BASE), value)
#define WriteRXDFFByte(offset, value)    rtl_outb((offset+RTL8814B_RXDFF_VIRTUAL_BASE), value)

#define ReadRXDFFDWord(offset)           (rtl_inl((offset+RTL8814B_RXDFF_VIRTUAL_BASE)))
#define ReadRXDFFWord(offset)            (rtl_inw((offset+RTL8814B_RXDFF_VIRTUAL_BASE)))
#define ReadRXDFFByte(offset)            (rtl_inb((offset+RTL8814B_RXDFF_VIRTUAL_BASE)))
#endif 

//3 TXFF
#define WriteTXFFDWord(offset, value)     rtl_outl((offset+RTL8721D_TXFF_AHB_BASE), value)
#define WriteTXFFWord(offset, value)      rtl_outw((offset+RTL8721D_TXFF_AHB_BASE), value)
#define WriteTXFFByte(offset, value)      rtl_outb((offset+RTL8721D_TXFF_AHB_BASE), value)

#define ReadTXFFDWord(offset)             (rtl_inl((offset+RTL8721D_TXFF_AHB_BASE)))
#define ReadTXFFWord(offset)              (rtl_inw((offset+RTL8721D_TXFF_AHB_BASE)))
#define ReadTXFFByte(offset)              (rtl_inb((offset+RTL8721D_TXFF_AHB_BASE)))

//3 Retention RAM
#define WriteRRamDWord(offset, value)     rtl_outl((offset+RETENTION_RAM_BASE), value)
#define WriteRRamWord(offset, value)      rtl_outw((offset+RETENTION_RAM_BASE), value)
#define WriteRRamByte(offset, value)      rtl_outb((offset+RETENTION_RAM_BASE), value)

#define ReadRRamDWord(offset)             (rtl_inl((offset+RETENTION_RAM_BASE)))
#define ReadRRamWord(offset)              (rtl_inw((offset+RETENTION_RAM_BASE)))
#define ReadRRamByte(offset)              (rtl_inb((offset+RETENTION_RAM_BASE)))


