Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_HAL_ROM.h
//3 TX report buffer access
#define WriteTxrptByte(macid,offset,val)        rtl_outb(RTL8721D_TXRPT_BASE + (macid<<4) + offset, val) //macid range: 0~16; offset range: 0~15
#define WriteTxrptDWord(macid,offset,val)       rtl_outl(RTL8721D_TXRPT_BASE + (macid<<4) + offset, val)
#define ReadTxrptByte(macid,offset)             rtl_inb(RTL8721D_TXRPT_BASE + (macid<<4) + offset)
#define ReadTxrptDWord(macid,offset)            rtl_inl(RTL8721D_TXRPT_BASE + (macid<<4) + offset)

#define WriteBcnrptByte(macid,offset,val)       rtl_outb(RTL8721D_BCNRPT_BASE + (macid<<4) + offset, val) //macid range: 0~16; offset range: 0~15
#define WriteBcnrptDWord(macid,offset,val)      rtl_outl(RTL8721D_BCNRPT_BASE + (macid<<4) + offset, val)
#define ReadBcnrptByte(macid,offset)            rtl_inb(RTL8721D_BCNRPT_BASE + (macid<<4) + offset)
#define ReadBcnrptDWord(macid,offset)           rtl_inl(RTL8721D_BCNRPT_BASE + (macid<<4) + offset)

#define WriteSperptByte(macid,offset,val)       rtl_outb(RTL8721D_SPERPT_BASE + (macid<<3) + offset, val) //macid range: 0~16; offset range: 0~7
#define WriteSperptDWord(macid,offset,val)      rtl_outl(RTL8721D_SPERPT_BASE + (macid<<3) + offset, val)
#define ReadSperptByte(macid,offset)            rtl_inb(RTL8721D_SPERPT_BASE + (macid<<3) + offset)
#define ReadSperptDWord(macid,offset)           rtl_inl(RTL8721D_SPERPT_BASE + (macid<<3) + offset)

#define ReadRAMASKByte(macid, offset)           rtl_inb(RTL8721D_RAMASK_BASE + (macid<<3) + offset)     //macid range: 0~16; offset range: 0~7
#define ReadRAMASKDWORD(macid, offset)          rtl_inl(RTL8721D_RAMASK_BASE + (macid<<3) + offset)
#define WriteRAMASKByte(macid, offset, val)     rtl_outb(RTL8721D_RAMASK_BASE + (macid<<3) + offset, val)
#define WriteRAMASKDWORD(macid, offset, val)    rtl_outl(RTL8721D_RAMASK_BASE + (macid<<3) + offset, val)

#define ReadNANrptByte(offset)                  rtl_inb(RTL8721D_NANRPT_BASE  + offset)     
#define ReadNANrptDWORD(offset)                 rtl_inl(RTL8721D_NANRPT_BASE  + offset)
#define WriteNANrptByte(offset, val)            rtl_outb(RTL8721D_NANRPT_BASE + offset, val)
#define WriteNANrptDWORD(offset, val)           rtl_outl(RTL8721D_NANRPT_BASE + offset, val)


//3 BT mailbox
#define WriteBTMailboxDWord(offset, value)      rtl_outl((offset+RTL8721D_BT_MAILBOX_AHB_BASE), value)
#define WriteBTMailboxWord(offset, value)       rtl_outw((offset+RTL8721D_BT_MAILBOX_AHB_BASE), value)
#define WriteBTmailboxByte(offset, value)       rtl_outb((offset+RTL8721D_BT_MAILBOX_AHB_BASE), value)

#define ReadBTMailboxDWord(offset)             (rtl_inl((offset+RTL8721D_BT_MAILBOX_AHB_BASE)))
#define ReadBTMailboxWord(offset)              (rtl_inw((offset+RTL8721D_BT_MAILBOX_AHB_BASE)))
#define ReadBTMailboxByte(offset)              (rtl_inb((offset+RTL8721D_BT_MAILBOX_AHB_BASE)))

//3 DDMA
#define WriteDDMADWord(offset, value)           rtl_outl((offset+RTL8721D_DDMA_CTRL_AHB_BASE), value)
#define WriteDDMAWord(offset, value)            rtl_outw((offset+RTL8721D_DDMA_CTRL_AHB_BASE), value)
#define WriteDDMAByte(offset, value)            rtl_outb((offset+RTL8721D_DDMA_CTRL_AHB_BASE), value)

#define ReadDDMADWord(offset)                  (rtl_inl((offset+RTL8721D_DDMA_CTRL_AHB_BASE)))
#define ReadDDMAWord(offset)                   (rtl_inw((offset+RTL8721D_DDMA_CTRL_AHB_BASE)))
#define ReadDDMAByte(offset)                   (rtl_inb((offset+RTL8721D_DDMA_CTRL_AHB_BASE)))


//Interrupt List
#ifdef _MCU_8051_
#define INT_USB_8721D         0
#define INT_WLAN_8721D        2
#define INT_UART_8721D        4
#define INT_SYS_8721D         8
#define INT_FT_8721D          9
#define INT_MAILBOX_8721D    10
#else
#define INT_USB_8721D         
#define INT_WLAN_8721D        
#define INT_UART_8721D        
#define INT_SYS_8721D         
#define INT_FT_8721D          
#define INT_MAILBOX_8721D    
#endif

//function pointer, added by jackie;
#define OSSendSignalCommon      OSSendSignalCommon_Ptr
#define ISRSendSignalCommon     ISRSendSignalCommon_Ptr
#define Change_PS_State             Change_PS_State_Ptr
#define IssueC2HPKT                     IssueC2HPKT_Ptr
#define FillC2HContant                  FillC2HContant_Ptr
#define C2HPKTRxDESC                C2HPKTRxDESC_Ptr
#define BTC_Pnty_ShiftRAM8721D               BTC_Pnty_Shift_Ptr
#define IssueCTS2Self                   IssueCTS2Self_Ptr
#define ChkandChangePS              ChkandChangePS_Ptr
#define IssuePSPoll                         IssuePSPoll_Ptr
#define ReadRxBuff                      ReadRxBuff_Ptr
#define IssueQNull                          IssueQNull_Ptr
#define PowerBitSetting                 PowerBitSetting_Ptr
#define ChangeTransmiteRate         ChangeTransmiteRate_Ptr
#define IssueNullData                       IssueNullData_Ptr

//#define PktBufAccessCtrl            PktBufAccessCtrl_CallPtr
#define PktBufAccessCtrl            PktBufAccessCtrl_Ptr
#define SetTxbufAddrFromPageNum     SetTxbufAddrFromPageNum_8721D_ROM


//Interrupt List
#define INT_USB             INT_USB_8721D
#define INT_WLAN            INT_WLAN_8721D
#define INT_UART            INT_UART_8721D
#define INT_SYS             INT_SYS_8721D
#define INT_FT              INT_FT_8721D
#define INT_MAILBOX         INT_MAILBOX_8721D

// HAL Structure
//#define HAL_DATA_TYPE         HAL_DATA_COMMON
//#define HAL_DATA_TYPE       HAL_DATA_8721D

// Interrupt handle function
//#define USB_INT_HDL         USB_INT_HDL_8721D/
//#define WLAN_INT_HDL        WLAN_INT_HDL_8721D
//#define UART_INT_HDL        UART_INT_HDL_8721D
//#define FT_INT_HDL          FT_INT_HDL_8721D
//#define SYS_INT_HDL         SYS_INT_HDL_8721D
//#define MAILBOX_INT_HDL_RAM      MAILBOX_INT_HDL_RAM_8721D

// Initial Offload Decision
//#define CheckInitialOffload     CheckInitialOffload_8721D_ROM
//#define INIT_OFLD_TYPE          INIT_OFLD_8721D

// ROM/RAM Decision
//#define CheckJumpToRAM          CheckJumpToRAM_8721D_ROM

//Download FW through TxPKTBuf
//#define CheckROMDLFWEnable      CheckROMDLFWEnable_8721D_ROM

//FWLBK
#define CheckFWLBKEnable        CheckFWLBKEnable_8721D_ROM


