Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_HAL_ROM.h
#if 0
// Reg R/W
//byte
#define WriteMACRegByte(addr, value)         WriteXBYTE((u32)addr|WIFI_BASEADDR, value)
#define ReadMACRegByte(addr)                 ReadXBYTE((u32)addr|WIFI_BASEADDR)
#define WritePONRegByte(addr, value)         WriteXBYTE((u32)addr|WIFI_BASEADDR, value)
#define ReadPONRegByte(addr)                 ReadXBYTE((u32)addr|WIFI_BASEADDR)
#define RWritePONRegByte(addr, value)        WriteXBYTE((u32)addr|WIFI_BASEADDR, value)
#define RReadPONRegByte(addr)                ReadXBYTE((u32)addr|WIFI_BASEADDR)
#define WriteCPURegByte                      WriteXBYTE
#define ReadCPURegByte                       ReadXBYTE
#define WriteUSBRegByte                      WriteXBYTE
#define ReadUSBRegByte                       ReadXBYTE

//Word (2 Bytes)
#define ReadMACRegWord(addr)                 ReadXWORD((u32)addr|WIFI_BASEADDR)
#define WriteMACRegWord(addr, value)         WriteXWORD((u32)addr|WIFI_BASEADDR, value)

//DWord (4 Bytes)
#define ReadMACRegDWord(addr)                ReadXDWORD((u32)addr|WIFI_BASEADDR)
#define WriteMACRegDWord(addr, value)        WriteXDWORD((u32)addr|WIFI_BASEADDR, value)
#endif

// BB/RF R/W

#define PHY_InitBBRFRegDef              PHY_InitBBRFRegDef_8721D

#define CheckBBRWIsStable               CheckBBRWIsStable_8721D
#define PHY_QueryBBReg                  PHY_QueryBBReg_8721D
#define PHY_SetBBReg                    PHY_SetBBReg_8721D


#define PHY_RFSerialRead                PHY_RFSerialRead_8721D
#define PHY_RFSerialWrite               PHY_RFSerialWrite_8721D

#define PHY_QueryRFReg                  PHY_QueryRFReg_8721D
#define PHY_SetRFReg                    PHY_SetRFReg_8721D_RAM

// Efuse
//#define EfuseOneByteRead                EfuseOneByteRead_8721D_ROM

// Delay Function
//#define DelayUS                         DelayUS_8721D_ROM
//#define DelayMS                         DelayMS_8721D_ROM

//2  GTimer
//#define InitGTimer32us                  InitGTimer32us_CallPtr
//#define InitGTimer1ms                   InitGTimer1ms_CallPtr
#define InitGTimer32us              InitGTimer32us_Ptr
#define InitGTimer1ms               InitGTimer1ms_Ptr

//2 Basic IO
#define PollingReg                  PollingReg_8721D_Ptr

//#define ClrAllFWUsedIMR         ClrAllFWUsedIMR_8721D

//#define SetMediaStatus          SetMediaStatus_8721D
#define GetMediaStatus          GetMediaStatus_8721D_ROM
#define CheckMaxMacidNum        CheckMaxMacidNum_8721D_ROM

//2 4.) FS ISR

// Interrupt IMR / ISR
#define setwlanimr              setwlanimr_8721D_ROM
#define clrwlanimr              clrwlanimr_8721D_ROM
//#define setwlanimr2              setwlanimr2_8721D   
//#define clrwlanimr2              clrwlanimr2_8721D
//#define setsysimr               setsysimrCommon
//#define clrsysimr               clrsysimrCommon
#define setftimr                setftimr_8721D_ROM
#define clrftimr                clrftimr_8721D_ROM

//2 H2C
//#define CheckH2CMailbox         CheckH2CMailboxCommon
#define H2CCmdFunc              H2CCmdFunc_Ptr
//#define MediaConnection         MediaConnectionCommon
//#define MediaDisconnection      MediaDisconnectionCommon
#define H2CInQueue              H2CInQueue_Ptr
//#define H2CDeQueue              H2CDeQueue_8721D

//2 C2H
//#define InitC2H                 InitC2H_8721D_ROM
#define C2HInQueue              C2HInQueue_Ptr
//#define C2HDeQueue              C2HDeQueue_8721D
#define WaitC2HOk               WaitC2HOk_8721D_ROM

// RF ON/OFF
#define PsOpenRF                         PsOpenRF_Ptr
#define PsCloseRF                        PsCloseRF_Ptr

//2 Packet
//#define CheckCPUMGQEmpty                CheckCPUMGQEmpty_8721D
//#define IssueRsvdPagePacketSetting    IssueRsvdPagePacketSetting_CallPtr
#define IssueRsvdPagePacketSetting    IssueRsvdPagePacketSetting_Ptr
#define CheckTxPktBufOverFlow           CheckTxPktBufOverFlow_8721D_ROM
//#define CheckRxPktBufOverFlow           CheckRxPktBufOverFlow_8721D

//2 PowerCtrl
#define WaitTxStateMachineOk            WaitTxStateMachineOk_Ptr
//#define GetRPWMValue                       GetRPWMValueCommon
//#define GetRPWM2Value                     GetRPWMValue2Common
//#define CheckTSFIsStable                   CheckTSFIsStableCommon
//#define WaitHWStateReady                 WaitHWStateReadyCommon
#define WriteTxPause				     WriteTxPause_Ptr
#define WriteTxPauseWithMask            WriteTxPauseWithMask_Ptr

//3 5.) BTConcurr
#define Write778        Write778_Ptr
#define DacSwing	    DacSwing_Ptr
#define InitBTMailbox   InitBTMailbox_Ptr
#define BTMailboxRetry	BTMailboxRetry_Ptr
#define C2HBTInfo		C2HBTInfo_Ptr
#define C2HBTLoopback	C2HBTLoopback_Ptr
#define C2HBTMpRpt		C2HBTMpRpt_Ptr
#define IssueBTQNull	IssueBTQNull_Ptr
#define WlanActCtrl		WlanActCtrl_Ptr

#define ChangeCoexTable	ChangeCoexTable_Ptr

//#define InitBTypeTDMA	InitBTypeTDMA_Ptr

#define InitBTypeTDMA2	InitBTypeTDMA2_Ptr

#define BTypeTDMABCNEarly	BTypeTDMABCNEarly_Ptr

#define BTypeTDMATBTThdl	BTypeTDMATBTThdl_Ptr

#define BTypeTDMATimeOuthdl		BTypeTDMATimeOuthdl_Ptr
#if 0   //IS_CUT_A(CONFIG_CHIP_SEL)
#define AntennaSwitchCtrl			AntennaSwitchCtrl_Ptr
#endif

#define MailboxINTHDL		        MailboxINTHDL_Ptr
#define MailboxINTHDL_Patch		MailboxINTHDL_Patch_Ptr

#define BTRoleChangeTBTTHDL		BTRoleChangeTBTTHDL_Ptr

#define BTRoleChangeTimerHDL	BTRoleChangeTimerHDL_Ptr


//#define C2HBTMailBoxStatus		C2HBTMailBoxStatus_Ptr
#define InitBTCoexTimer			InitBTCoexTimer_Ptr

//#define InitSCOTimer				InitSCOTimer_Ptr

//#define BTSCOeSCOIssueNullHDL	BTSCOeSCOIssueNullHDL_Ptr
//#define AOAC_ANT_SWT			AOAC_ANT_SWT_CallPtr
#define AOAC_ANT_SWT			AOAC_ANT_SWT_Ptr
//#define BTNullSetting				BTNullSetting_CallPtr
#define BTNullSetting				BTNullSetting_Ptr
#define BT_TDMA_Slot_Operation_0and3	BT_TDMA_Slot_Operation_0and3_Ptr
#define FlexibleExtensionDecision		FlexibleExtensionDecision_Ptr
#define BT_TDMA_Slot_Operation_1and4	BT_TDMA_Slot_Operation_1and4_Ptr
#define BT_TDMA_Slot_Operation_2and5	BT_TDMA_Slot_Operation_2and5_Ptr
#define BackupAntennaSetting		BackupAntennaSetting_Ptr
#define BTRoleChangeDefaultSetting	BTRoleChangeDefaultSetting_Ptr
//#define BTSCOeSCOAntSetup		BTSCOeSCOAntSetup_Ptr
//#define SCO_eSCO_IssueCtrlData	SCO_eSCO_IssueCtrlData_Ptr

