Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_HAL_ROM.h
#define FillMailbox		     FillMailbox_Ptr
#define WL2BTMailbox		 WL2BTMailbox_Ptr
//#define H2CHDL_BTPSTDMA		H2CHDL_BTPSTDMA_8721D
//#define	H2CHDL_BTInfo		H2CHDL_BTInfo_8721D
//#define	H2CHDL_ForceBTTxpwr		H2CHDL_ForceBTTxpwr_8721D
//#define H2CHDL_BTIgnoreWlanAct		H2CHDL_BTIgnoreWlanAct_8721D
//#define H2CHDL_DACSwingValue		H2CHDL_DACSwingValue_8721D
//#define H2CHDL_AntSelReverse		H2CHDL_AntSelReverse_8721D
//#define H2CHDL_WLOpmode			H2CHDL_WLOpmode_8721D
//#define H2CHDL_BTMpH2C			H2CHDL_BTMpH2C_8721D
//#define H2CHDL_BTControl		H2CHDL_BTControl_8721D
//#define H2CHDL_BTWifiCtrl		H2CHDL_BTWifiCtrl_8721D
//#define H2CHDL_BT_SCO_eSCO_Operation		H2CHDL_BT_SCO_eSCO_Operation_8721D
//#define H2CHDL_BT_Page_Scan_Interval		H2CHDL_BT_Page_Scan_Interval_8721D
//#define H2CHDL_WLCalibration		H2CHDL_WLCalibration_8721D
//#define H2CHDL_GNT_BT_CTRL		H2CHDL_GNT_BT_CTRL_8721D
//#define H2CHDL_BT_ONLY_TEST		H2CHDL_BT_ONLY_TEST_8721D

//3 6.)power save
#define SetSmartPSTimer			SetSmartPSTimer_Ptr
#define	SetPwrStateReg			SetPwrStateReg_Ptr
#define	ResetPSParm				ResetPSParm_Ptr
//#define	ChkTxQueueIsEmpty		ChkTxQueueIsEmpty_8721D
#define	Legacy_PS_Setting		Legacy_PS_Setting_Ptr
#define PSModeSetting			PSModeSetting_Ptr
#define	ConfigListenBeaconPeriod		ConfigListenBeaconPeriod_Ptr
//#define PSSetMode			PSSetMode_8721D
//#define PS_S2ToS3State		PS_S2ToS3State_8721D
#define PS_S2ToS0State		PS_S2ToS0State_Ptr
//#define	PS_S3ToS2orS0State	PS_S3ToS2orS0State_8721D
//#define	PS_S0ToS1State		PS_S0ToS1State_8721D
//#define	PS_S1ToS0orS2State	PS_S1ToS0orS2State_8721D
//#define	PS_S2ToS4State		PS_S2ToS4State_8721D
//#define PS_S2ToS5State		PS_S2ToS5State_8721D
//#define PS_S5ToS2State		PS_S5ToS2State_8721D
#define	PS_S4ToS2State		PS_S4ToS2State_8721D_ROM
//#define	SmartPS2InitTimerAndToGetRxPkt	SmartPS2InitTimerAndToGetRxPkt_8721D
//#define SetBcnEarlyAndTimeout	SetBcnEarlyAndTimeout_CallPtr
#define SetBcnEarlyAndTimeout	SetBcnEarlyAndTimeout_Ptr
//#define BcnEarlyAdjustByTSF		BcnEarlyAdjustByTSF_8721D
#define	EnlargeBcnEarlyAndTimeout	EnlargeBcnEarlyAndTimeout_Ptr
#define ResetBcnEarlyAdjustParm		ResetBcnEarlyAdjustParm_Ptr
//#define PS_S0ToS6State		PS_S0ToS6State_8721D
//#define PS_S6ToS0State		PS_S6ToS0State_8721D


//3 7 Rate Adaptive
#define InitRAInfo_rsvd                  InitRAInfo_rsvd_Ptr
//#define TryDone                             TryDone_Ptr
#define check_rate                      check_rate_Ptr
//#define Set_arfr                        Set_arfr_CallPtr
#define Set_arfr                        Set_arfr_Ptr
#define ArfrRefresh                     ArfrRefresh_Ptr
#define InitialRateByRssi               InitialRateByRssi_Ptr
#define ODM_H2C_RADebugMonitor          ODM_H2C_RADebugMonitor_Ptr
//#define InitialRateUpdate               InitialRateUpdate_CallPtr
#define InitialRateUpdate               InitialRateUpdate_Ptr
#define RateUp_search_RateMask          RateUp_search_RateMask_Ptr
#define RateDown_search_RateMask        RateDown_search_RateMask_8721D_ROM

#define PsuseTxrpt                      PsuseTxrpt_8721D_ROM
#define ResetTxrpt                      ResetTxrpt_8721D_ROM

//3 WoWlan

#define UpdateIV                UpdateIV_Ptr
#define GetMACHeaderLen         GetMACHeaderLen_Ptr
#define WakeUpHost              WakeUpHost_Ptr
#define GetIVLenAndSecurityType GetIVLenAndSecurityType_Ptr
#define updateCheckSumVer2      updateCheckSumVer2_Ptr

//3 AES GTK
//#define AesTkipIvFun            AesTkipIvFun_CallPtr
#define AesTkipIvFun            AesTkipIvFun_Ptr
#define WepIvFun                WepIvFun_Ptr
#define OnWpa_offload           OnWpa_offload_Ptr
#define wpa_supplicant_process_1_of_2   wpa_supplicant_process_1_of_2_Ptr
#define wpa_supplicant_decrypt_key_data wpa_supplicant_decrypt_key_data_Ptr
#define wpa_supplicant_send_2_of_2      wpa_supplicant_send_2_of_2_Ptr
#define write_cam_wow                   write_cam_wow_Ptr
#define WriteCAM                WriteCAM_Ptr
#define ReadCAM                 ReadCAM_Ptr
#define ReadGTKData          ReadGTKData_Ptr
#define AppendTkipMIC       AppendTkipMIC_Ptr
#define RTmemcmpBackward       RTmemcmpBackward_Ptr
#define AesTkipIvCheck       AesTkipIvCheck_Ptr
#define WepIvCheck       WepIvCheck_Ptr
#define AssignIvToKeyRsc       AssignIvToKeyRsc_Ptr
#define AssignKeyRscToIV       AssignKeyRscToIV_Ptr



//2 IPSec

#define getSumValue             getSumValue_8721D_PTR
#define getCheckSum             getCheckSum_8721D_PTR

#define IPSecDataIn             IPSecDataIn_8721D_PTR
#define IPSecDataOut            IPSecDataOut_8721D_PTR
#define IPSecFillDesrciptor     IPSecFillDesrciptor_8721D_PTR
#define IPSWriteDescriptorIO    IPSWriteDescriptorIO_8721D_PTR
#define IPSecDesrciptor         IPSecDesrciptor_8721D_PTR
#define IPSecWriteDataIOMode    IPSecWriteDataIOMode_8721D_PTR
#define IPSecGetDataIOMode      IPSecGetDataIOMode_8721D_PTR
#define IPSecSetOPMode          IPSecSetOPMode_8721D_PTR
#define IPSecEngine             IPSecEngine_8721D_PTR
#define IPSecSetExMemoryAddr    IPSecSetExMemoryAddr_8721D_PTR
#define IPSecSetDescAddr        IPSecSetDescAddr_8721D_PTR
#define AesUnwrapIpsec          AesUnwrapIpsec_8721D_PTR
#define AESUnwrapSwap           AESUnwrapSwap_8721D_PTR
#define HmacSha1Ipsec           HmacSha1Ipsec_8721D_PTR
#define HmcMd5Ipsec             HmcMd5Ipsec_8721D_PTR
#define RC4Ipsec                RC4Ipsec_8721D_PTR
#define TkipMicIpsec            TkipMicIpsec_8721D_PTR
#define Aes128EncIpsec          Aes128EncIpsec_8721D_PTR
#define Aes128DecIpsec          Aes128DecIpsec_8721D_PTR
#define FillParameterIpsec      FillParameterIpsec_8721D_PTR
#define FillMichaelPacketInfo   FillMichaelPacketInfo_8721D_PTR
/* AES operations */
#define AESEncrypt128               AESEncrypt128_8721D_PTR
#define AESDecrypt128               AESDecrypt128_8721D_PTR
#define AES_KeyExpansion_1W         AES_KeyExpansion_1W_8721D_PTR
#define AES_CMAC_GenerateSubKey_1W  AES_CMAC_GenerateSubKey_1W_8721D_PTR
#define AES_CMAC_1W                 AES_CMAC_1W_8721D_PTR
#define AES_Encrypt_1W              AES_Encrypt_1W_8721D_PTR


//2 FWLBK
#define FwlbkDbgPrtU16              FwlbkDbgPrtU16_8721D_PTR
//#define FwlbkDbgStepByStep          FwlbkDbgStepByStep_8721D_PTR
#define FwlbkLLTWrite               FwlbkLLTWrite_8721D_PTR
#define FwlbkHWInitialLLT           FwlbkHWInitialLLT_8721D_PTR
#define FwlbkMode                   FwlbkMode_8721D_PTR
#define FwlbkPreparePkt             FwlbkPreparePkt_8721D_PTR
#define FwlbkModeSel                FwlbkModeSel_8721D_PTR
#define FwlbkCheckRxPayload         FwlbkCheckRxPayload_8721D_PTR
#define FwlbkSetCAM                 FwlbkSetCAM_8721D_PTR
#define FwlbkUpdateParam            FwlbkUpdateParam_8721D_PTR
#define FwlbkMcuPollMgq             FwlbkMcuPollMgq_8721D_PTR
#define FwlbkModeTxNoCheck          FwlbkModeTxNoCheck_8721D_PTR
#define FwlbkModeTx                 FwlbkModeTx_8721D_PTR
#define FwlbkModeMaclbk             FwlbkModeMaclbk_8721D_PTR
#define FwlbkModeSecTest            FwlbkModeSecTest_8721D_PTR
#define FwlbkModeAFElbk             FwlbkModeAFElbk_8721D_PTR

/*--------------------Define Enum---------------------------------------*/

/*--------------------Define MACRO--------------------------------------*/

/*--------------------Define Struct---------------------------------------*/

#ifndef __ASSEMBLY__

typedef struct _HAL_DATA_COMMON {

    u8  HCISel;

}HAL_DATA_COMMON, *PHAL_DATA_COMMON;

typedef struct _HAL_DATA_8721D {

    //IMR & ISR
#if 0    
    u8  sysimr[4];
    u8  sysisr[4];
#endif

    u8  wlanimr[4];
    u8  wlanisr[4];
    
    u8  wlanimr2[4];
    u8  wlanisr2[4];
    
    u8  ftimr[4];
    u8  ftisr[4];
}HAL_DATA_8721D, *PHAL_DATA_8721D;

#endif //__ASSEMBLY__
/*--------------------Export global variable-------------------------------*/

/*--------------------Function declaration---------------------------------*/


#endif  //__RTL8721D_HAL_H__

